<template>
  <svg
    xmlns="http://www.w3.org/2000/svg"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    width="71.848"
    height="71.848"
    viewBox="0 0 71.848 71.848"
  >
    <defs>
      <clipPath id="clip-path">
        <rect
          id="Прямоугольник_1"
          data-name="Прямоугольник 1"
          width="71.848"
          height="71.848"
          fill="none"
        />
      </clipPath>
    </defs>
    <g id="Сгруппировать_3" data-name="Сгруппировать 3" transform="translate(0 0)">
      <path
        id="Контур_1"
        data-name="Контур 1"
        d="M48.9,0l-10.5,10.5h5.248L48.9,5.249l5.25,5.249H59.4Z"
        transform="translate(-12.61)"
        fill="#005489"
      />
      <path
        id="Контур_2"
        data-name="Контур 2"
        d="M84.436,16.054V30.9L80.725,27.19V19.766H73.3l-3.712-3.712Z"
        transform="translate(-22.849 -5.271)"
        fill="#005489"
        fill-rule="evenodd"
      />
      <path
        id="Контур_3"
        data-name="Контур 3"
        d="M91.341,43.654,96.59,48.9l-5.249,5.249V59.4l10.5-10.5-10.5-10.5Z"
        transform="translate(-29.991 -12.61)"
        fill="#005489"
      />
      <path
        id="Контур_4"
        data-name="Контур 4"
        d="M83.659,84.436H68.812l3.712-3.712h7.424V73.3l3.712-3.712Z"
        transform="translate(-22.594 -22.849)"
        fill="#005489"
        fill-rule="evenodd"
      />
      <path
        id="Контур_5"
        data-name="Контур 5"
        d="M53.053,91.341,47.8,96.59l-5.249-5.25H37.3l10.5,10.5,10.5-10.5Z"
        transform="translate(-12.249 -29.991)"
        fill="#005489"
      />
      <path
        id="Контур_6"
        data-name="Контур 6"
        d="M15.277,83.659V68.812l3.712,3.712v7.424h7.424l3.712,3.712Z"
        transform="translate(-5.016 -22.594)"
        fill="#005489"
        fill-rule="evenodd"
      />
      <path
        id="Контур_7"
        data-name="Контур 7"
        d="M0,47.8,10.5,58.3V53.054L5.25,47.8l5.248-5.25V37.306Z"
        transform="translate(0 -12.249)"
        fill="#005489"
      />
      <path
        id="Контур_8"
        data-name="Контур 8"
        d="M16.054,15.277H30.9L27.19,18.988H19.766v7.424l-3.712,3.712Z"
        transform="translate(-5.271 -5.016)"
        fill="#005489"
        fill-rule="evenodd"
      />
      <g id="Сгруппировать_2" data-name="Сгруппировать 2" transform="translate(0 0)">
        <g
          id="Сгруппировать_1"
          data-name="Сгруппировать 1"
          transform="translate(0 0)"
          clip-path="url(#clip-path)"
        >
          <path
            id="Контур_9"
            data-name="Контур 9"
            d="M55.951,43.71V23.623h1.007a20.087,20.087,0,0,1,0,40.173H55.951Zm2.015-18.043V61.754a18.072,18.072,0,0,0,0-36.088"
            transform="translate(-18.371 -7.756)"
            fill="#006879"
            fill-rule="evenodd"
          />
          <path
            id="Контур_10"
            data-name="Контур 10"
            d="M39.84,42.7V36.01a21.433,21.433,0,0,1-7.118-2.133A19.878,19.878,0,0,0,30.167,42.7Zm0,12.341a19.417,19.417,0,0,0-5.121,1.4q.607.733,1.279,1.406a20.077,20.077,0,0,0,3.843,3.005Zm-6.976,2.308A22.1,22.1,0,0,0,37,61.37a17.979,17.979,0,0,1-6.236-2.662,19.515,19.515,0,0,1,2.1-1.356m-6.22.561a20.087,20.087,0,0,1,14.2-34.29h1.007V63.8H40.848a18.473,18.473,0,0,1-14.2-5.884m2.456-.47a21.694,21.694,0,0,1,2.581-1.737,21.892,21.892,0,0,1-3.532-10.988H22.8a18.012,18.012,0,0,0,5.265,11.771q.5.5,1.031.954m4.385-2.66a21.439,21.439,0,0,1,6.355-1.769v-8.3H30.167a19.878,19.878,0,0,0,3.319,10.065m6.355-20.8a19.444,19.444,0,0,1-6.031-1.813,20.061,20.061,0,0,1,6.031-5.6Zm-7.8-2.8A22.108,22.108,0,0,1,37,26.049a18,18,0,0,0-7.29,3.428,19.686,19.686,0,0,0,2.327,1.705m-3.855-.363a21.619,21.619,0,0,0,2.785,2.069A21.894,21.894,0,0,0,28.149,42.7H22.8a18.015,18.015,0,0,1,5.265-11.772Z"
            transform="translate(-6.817 -7.756)"
            fill="#006879"
            fill-rule="evenodd"
          />
        </g>
      </g>
    </g>
  </svg>
</template>
