<template>
    <svg id="hourglass" xmlns="http://www.w3.org/2000/svg" width="26.29" height="41.511" viewBox="0 0 26.29 41.511">
        <g id="Сгруппировать_38" data-name="Сгруппировать 38" transform="translate(0)">
            <g id="Сгруппировать_37" data-name="Сгруппировать 37" transform="translate(0)">
                <path id="Контур_408" data-name="Контур 408"
                    d="M118.081,0H95.943a2.076,2.076,0,1,0,0,4.151h22.139a2.076,2.076,0,1,0,0-4.151Zm0,2.767H95.943a.692.692,0,1,1,0-1.384h22.139a.692.692,0,1,1,0,1.384Z"
                    transform="translate(-93.867)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_40" data-name="Сгруппировать 40" transform="translate(0 37.36)">
            <g id="Сгруппировать_39" data-name="Сгруппировать 39" transform="translate(0)">
                <path id="Контур_409" data-name="Контур 409"
                    d="M118.081,460.8H95.943a2.076,2.076,0,1,0,0,4.151h22.139a2.076,2.076,0,1,0,0-4.151Zm0,2.767H95.943a.692.692,0,1,1,0-1.384h22.139a.692.692,0,1,1,0,1.384Z"
                    transform="translate(-93.867 -460.8)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_42" data-name="Сгруппировать 42" transform="translate(2.767 2.767)">
            <g id="Сгруппировать_41" data-name="Сгруппировать 41" transform="translate(0)">
                <path id="Контур_410" data-name="Контур 410"
                    d="M143.308,49.554A18.477,18.477,0,0,0,148.755,36.4V34.826a.692.692,0,0,0-.692-.692H128.692a.692.692,0,0,0-.692.692V36.4a18.478,18.478,0,0,0,5.447,13.151l.7.7a2.648,2.648,0,0,1,0,3.746l-.7.7A18.476,18.476,0,0,0,128,67.841v1.577a.692.692,0,0,0,.692.692h19.372a.692.692,0,0,0,.692-.692V67.841a18.477,18.477,0,0,0-5.448-13.151l-.7-.7a2.649,2.649,0,0,1,0-3.746Zm-1.674-.283a4.032,4.032,0,0,0,0,5.7l.7.7a17.1,17.1,0,0,1,5.042,12.173v.885H129.384v-.885a17.1,17.1,0,0,1,5.041-12.173l.7-.7a4.031,4.031,0,0,0,0-5.7l-.7-.7A17.1,17.1,0,0,1,129.384,36.4v-.885h17.988V36.4a17.1,17.1,0,0,1-5.042,12.173Z"
                    transform="translate(-128 -34.134)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_44" data-name="Сгруппировать 44" transform="translate(7.611 9.272)">
            <g id="Сгруппировать_43" data-name="Сгруппировать 43" transform="translate(0)">
                <path id="Контур_411" data-name="Контур 411"
                    d="M199.122,116.746a.984.984,0,0,0-1-.586c-3.595,0-5.2-.77-5.832-1.229a2.957,2.957,0,0,0-2.721-.4,2.727,2.727,0,0,0-1.749,1.878,2.258,2.258,0,0,0-.073.38.73.73,0,0,0,.086.4,15.381,15.381,0,0,0,2.473,3.438l.695.7a5.376,5.376,0,0,1,1.586,3.829.692.692,0,0,0,1.384,0,5.38,5.38,0,0,1,1.586-3.829l.7-.7c.171-.17.394-.38.639-.61C198.676,118.336,199.428,117.518,199.122,116.746Zm-3.184,2.264c-.256.241-.49.461-.668.64l-.7.7a6.8,6.8,0,0,0-1.3,1.811,6.794,6.794,0,0,0-1.3-1.811l-.695-.7a13.27,13.27,0,0,1-2.118-2.915,1.352,1.352,0,0,1,.865-.9,1.574,1.574,0,0,1,1.448.217c.881.638,2.619,1.39,5.948,1.483C197,118.015,196.325,118.647,195.938,119.01Z"
                    transform="translate(-187.741 -114.362)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_46" data-name="Сгруппировать 46" transform="translate(5.58 29.057)">
            <g id="Сгруппировать_45" data-name="Сгруппировать 45" transform="translate(0)">
                <path id="Контур_412" data-name="Контур 412"
                    d="M177.823,364.573a6,6,0,0,0-2.114-4.253c-.14-.146-.287-.3-.437-.458A4.629,4.629,0,0,0,171.9,358.4h-3.287a4.631,4.631,0,0,0-3.369,1.461c-.15.161-.3.311-.437.457a5.992,5.992,0,0,0-2.114,4.255.691.691,0,0,0,.69.745h13.746a.692.692,0,0,0,.69-.746Zm-13.647-.638a4.809,4.809,0,0,1,1.632-2.655c.145-.151.3-.308.451-.473a3.238,3.238,0,0,1,2.358-1.023H171.9a3.243,3.243,0,0,1,2.358,1.022c.156.167.306.323.452.475a4.816,4.816,0,0,1,1.631,2.655Z"
                    transform="translate(-162.695 -358.4)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_48" data-name="Сгруппировать 48" transform="translate(12.432 22.139)">
            <g id="Сгруппировать_47" data-name="Сгруппировать 47" transform="translate(0)">
                <path id="Контур_413" data-name="Контур 413"
                    d="M247.9,273.067a.692.692,0,0,0-.692.692v.692a.692.692,0,1,0,1.384,0v-.692A.692.692,0,0,0,247.9,273.067Z"
                    transform="translate(-247.211 -273.067)" fill="#077cad" />
            </g>
        </g>
        <g id="Сгруппировать_50" data-name="Сгруппировать 50" transform="translate(12.432 25.598)">
            <g id="Сгруппировать_49" data-name="Сгруппировать 49" transform="translate(0)">
                <path id="Контур_414" data-name="Контур 414"
                    d="M247.9,315.733a.692.692,0,0,0-.692.692v.692a.692.692,0,0,0,1.384,0v-.692A.692.692,0,0,0,247.9,315.733Z"
                    transform="translate(-247.211 -315.733)" fill="#077cad" />
            </g>
        </g>
    </svg>
</template>